SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_i2c.h
/* Bit fields for I2C SADDR */
#define _I2C_SADDR_RESETVALUE                   0x00000000UL                            /**< Default value for I2C_SADDR                 */
#define _I2C_SADDR_MASK                         0x000000FEUL                            /**< Mask for I2C_SADDR                          */
#define _I2C_SADDR_ADDR_SHIFT                   1                                       /**< Shift value for I2C_ADDR                    */
#define _I2C_SADDR_ADDR_MASK                    0xFEUL                                  /**< Bit mask for I2C_ADDR                       */
#define _I2C_SADDR_ADDR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for I2C_SADDR                  */
#define I2C_SADDR_ADDR_DEFAULT                  (_I2C_SADDR_ADDR_DEFAULT << 1)          /**< Shifted mode DEFAULT for I2C_SADDR          */

/* Bit fields for I2C SADDRMASK */
#define _I2C_SADDRMASK_RESETVALUE               0x00000000UL                            /**< Default value for I2C_SADDRMASK             */
#define _I2C_SADDRMASK_MASK                     0x000000FEUL                            /**< Mask for I2C_SADDRMASK                      */
#define _I2C_SADDRMASK_SADDRMASK_SHIFT          1                                       /**< Shift value for I2C_SADDRMASK               */
#define _I2C_SADDRMASK_SADDRMASK_MASK           0xFEUL                                  /**< Bit mask for I2C_SADDRMASK                  */
#define _I2C_SADDRMASK_SADDRMASK_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for I2C_SADDRMASK              */
#define I2C_SADDRMASK_SADDRMASK_DEFAULT         (_I2C_SADDRMASK_SADDRMASK_DEFAULT << 1) /**< Shifted mode DEFAULT for I2C_SADDRMASK      */

/* Bit fields for I2C RXDATA */
#define _I2C_RXDATA_RESETVALUE                  0x00000000UL                            /**< Default value for I2C_RXDATA                */
#define _I2C_RXDATA_MASK                        0x000000FFUL                            /**< Mask for I2C_RXDATA                         */
#define _I2C_RXDATA_RXDATA_SHIFT                0                                       /**< Shift value for I2C_RXDATA                  */
#define _I2C_RXDATA_RXDATA_MASK                 0xFFUL                                  /**< Bit mask for I2C_RXDATA                     */
#define _I2C_RXDATA_RXDATA_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for I2C_RXDATA                 */
#define I2C_RXDATA_RXDATA_DEFAULT               (_I2C_RXDATA_RXDATA_DEFAULT << 0)       /**< Shifted mode DEFAULT for I2C_RXDATA         */

/* Bit fields for I2C RXDOUBLE */
#define _I2C_RXDOUBLE_RESETVALUE                0x00000000UL                            /**< Default value for I2C_RXDOUBLE              */
#define _I2C_RXDOUBLE_MASK                      0x0000FFFFUL                            /**< Mask for I2C_RXDOUBLE                       */
#define _I2C_RXDOUBLE_RXDATA0_SHIFT             0                                       /**< Shift value for I2C_RXDATA0                 */
#define _I2C_RXDOUBLE_RXDATA0_MASK              0xFFUL                                  /**< Bit mask for I2C_RXDATA0                    */
#define _I2C_RXDOUBLE_RXDATA0_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for I2C_RXDOUBLE               */
#define I2C_RXDOUBLE_RXDATA0_DEFAULT            (_I2C_RXDOUBLE_RXDATA0_DEFAULT << 0)    /**< Shifted mode DEFAULT for I2C_RXDOUBLE       */
#define _I2C_RXDOUBLE_RXDATA1_SHIFT             8                                       /**< Shift value for I2C_RXDATA1                 */
#define _I2C_RXDOUBLE_RXDATA1_MASK              0xFF00UL                                /**< Bit mask for I2C_RXDATA1                    */
#define _I2C_RXDOUBLE_RXDATA1_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for I2C_RXDOUBLE               */
#define I2C_RXDOUBLE_RXDATA1_DEFAULT            (_I2C_RXDOUBLE_RXDATA1_DEFAULT << 8)    /**< Shifted mode DEFAULT for I2C_RXDOUBLE       */

/* Bit fields for I2C RXDATAP */
#define _I2C_RXDATAP_RESETVALUE                 0x00000000UL                            /**< Default value for I2C_RXDATAP               */
#define _I2C_RXDATAP_MASK                       0x000000FFUL                            /**< Mask for I2C_RXDATAP                        */
#define _I2C_RXDATAP_RXDATAP_SHIFT              0                                       /**< Shift value for I2C_RXDATAP                 */
#define _I2C_RXDATAP_RXDATAP_MASK               0xFFUL                                  /**< Bit mask for I2C_RXDATAP                    */
#define _I2C_RXDATAP_RXDATAP_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for I2C_RXDATAP                */
#define I2C_RXDATAP_RXDATAP_DEFAULT             (_I2C_RXDATAP_RXDATAP_DEFAULT << 0)     /**< Shifted mode DEFAULT for I2C_RXDATAP        */

/* Bit fields for I2C RXDOUBLEP */
#define _I2C_RXDOUBLEP_RESETVALUE               0x00000000UL                            /**< Default value for I2C_RXDOUBLEP             */
#define _I2C_RXDOUBLEP_MASK                     0x0000FFFFUL                            /**< Mask for I2C_RXDOUBLEP                      */
#define _I2C_RXDOUBLEP_RXDATAP0_SHIFT           0                                       /**< Shift value for I2C_RXDATAP0                */
#define _I2C_RXDOUBLEP_RXDATAP0_MASK            0xFFUL                                  /**< Bit mask for I2C_RXDATAP0                   */
#define _I2C_RXDOUBLEP_RXDATAP0_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for I2C_RXDOUBLEP              */
#define I2C_RXDOUBLEP_RXDATAP0_DEFAULT          (_I2C_RXDOUBLEP_RXDATAP0_DEFAULT << 0)  /**< Shifted mode DEFAULT for I2C_RXDOUBLEP      */
#define _I2C_RXDOUBLEP_RXDATAP1_SHIFT           8                                       /**< Shift value for I2C_RXDATAP1                */
#define _I2C_RXDOUBLEP_RXDATAP1_MASK            0xFF00UL                                /**< Bit mask for I2C_RXDATAP1                   */
#define _I2C_RXDOUBLEP_RXDATAP1_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for I2C_RXDOUBLEP              */
#define I2C_RXDOUBLEP_RXDATAP1_DEFAULT          (_I2C_RXDOUBLEP_RXDATAP1_DEFAULT << 8)  /**< Shifted mode DEFAULT for I2C_RXDOUBLEP      */

