SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_i2c.h
/* Bit fields for I2C TXDATA */
#define _I2C_TXDATA_RESETVALUE                  0x00000000UL                            /**< Default value for I2C_TXDATA                */
#define _I2C_TXDATA_MASK                        0x000000FFUL                            /**< Mask for I2C_TXDATA                         */
#define _I2C_TXDATA_TXDATA_SHIFT                0                                       /**< Shift value for I2C_TXDATA                  */
#define _I2C_TXDATA_TXDATA_MASK                 0xFFUL                                  /**< Bit mask for I2C_TXDATA                     */
#define _I2C_TXDATA_TXDATA_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for I2C_TXDATA                 */
#define I2C_TXDATA_TXDATA_DEFAULT               (_I2C_TXDATA_TXDATA_DEFAULT << 0)       /**< Shifted mode DEFAULT for I2C_TXDATA         */

/* Bit fields for I2C TXDOUBLE */
#define _I2C_TXDOUBLE_RESETVALUE                0x00000000UL                            /**< Default value for I2C_TXDOUBLE              */
#define _I2C_TXDOUBLE_MASK                      0x0000FFFFUL                            /**< Mask for I2C_TXDOUBLE                       */
#define _I2C_TXDOUBLE_TXDATA0_SHIFT             0                                       /**< Shift value for I2C_TXDATA0                 */
#define _I2C_TXDOUBLE_TXDATA0_MASK              0xFFUL                                  /**< Bit mask for I2C_TXDATA0                    */
#define _I2C_TXDOUBLE_TXDATA0_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for I2C_TXDOUBLE               */
#define I2C_TXDOUBLE_TXDATA0_DEFAULT            (_I2C_TXDOUBLE_TXDATA0_DEFAULT << 0)    /**< Shifted mode DEFAULT for I2C_TXDOUBLE       */
#define _I2C_TXDOUBLE_TXDATA1_SHIFT             8                                       /**< Shift value for I2C_TXDATA1                 */
#define _I2C_TXDOUBLE_TXDATA1_MASK              0xFF00UL                                /**< Bit mask for I2C_TXDATA1                    */
#define _I2C_TXDOUBLE_TXDATA1_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for I2C_TXDOUBLE               */
#define I2C_TXDOUBLE_TXDATA1_DEFAULT            (_I2C_TXDOUBLE_TXDATA1_DEFAULT << 8)    /**< Shifted mode DEFAULT for I2C_TXDOUBLE       */

/* Bit fields for I2C IF */
#define _I2C_IF_RESETVALUE                      0x00000000UL                            /**< Default value for I2C_IF                    */
#define _I2C_IF_MASK                            0x001FFFFFUL                            /**< Mask for I2C_IF                             */
#define I2C_IF_START                            (0x1UL << 0)                            /**< START condition Interrupt Flag              */
#define _I2C_IF_START_SHIFT                     0                                       /**< Shift value for I2C_START                   */
#define _I2C_IF_START_MASK                      0x1UL                                   /**< Bit mask for I2C_START                      */
#define _I2C_IF_START_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_START_DEFAULT                    (_I2C_IF_START_DEFAULT << 0)            /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_RSTART                           (0x1UL << 1)                            /**< Repeated START condition Interrupt Flag     */
#define _I2C_IF_RSTART_SHIFT                    1                                       /**< Shift value for I2C_RSTART                  */
#define _I2C_IF_RSTART_MASK                     0x2UL                                   /**< Bit mask for I2C_RSTART                     */
#define _I2C_IF_RSTART_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_RSTART_DEFAULT                   (_I2C_IF_RSTART_DEFAULT << 1)           /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_ADDR                             (0x1UL << 2)                            /**< Address Interrupt Flag                      */
#define _I2C_IF_ADDR_SHIFT                      2                                       /**< Shift value for I2C_ADDR                    */
#define _I2C_IF_ADDR_MASK                       0x4UL                                   /**< Bit mask for I2C_ADDR                       */
#define _I2C_IF_ADDR_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_ADDR_DEFAULT                     (_I2C_IF_ADDR_DEFAULT << 2)             /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_TXC                              (0x1UL << 3)                            /**< Transfer Completed Interrupt Flag           */
#define _I2C_IF_TXC_SHIFT                       3                                       /**< Shift value for I2C_TXC                     */
#define _I2C_IF_TXC_MASK                        0x8UL                                   /**< Bit mask for I2C_TXC                        */
#define _I2C_IF_TXC_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_TXC_DEFAULT                      (_I2C_IF_TXC_DEFAULT << 3)              /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_TXBL                             (0x1UL << 4)                            /**< Transmit Buffer Level Interrupt Flag        */
#define _I2C_IF_TXBL_SHIFT                      4                                       /**< Shift value for I2C_TXBL                    */
#define _I2C_IF_TXBL_MASK                       0x10UL                                  /**< Bit mask for I2C_TXBL                       */
#define _I2C_IF_TXBL_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_TXBL_DEFAULT                     (_I2C_IF_TXBL_DEFAULT << 4)             /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_RXDATAV                          (0x1UL << 5)                            /**< Receive Data Valid Interrupt Flag           */
#define _I2C_IF_RXDATAV_SHIFT                   5                                       /**< Shift value for I2C_RXDATAV                 */
#define _I2C_IF_RXDATAV_MASK                    0x20UL                                  /**< Bit mask for I2C_RXDATAV                    */
#define _I2C_IF_RXDATAV_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_RXDATAV_DEFAULT                  (_I2C_IF_RXDATAV_DEFAULT << 5)          /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_ACK                              (0x1UL << 6)                            /**< Acknowledge Received Interrupt Flag         */
#define _I2C_IF_ACK_SHIFT                       6                                       /**< Shift value for I2C_ACK                     */
#define _I2C_IF_ACK_MASK                        0x40UL                                  /**< Bit mask for I2C_ACK                        */
#define _I2C_IF_ACK_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_ACK_DEFAULT                      (_I2C_IF_ACK_DEFAULT << 6)              /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_NACK                             (0x1UL << 7)                            /**< Not Acknowledge Received Interrupt Flag     */
#define _I2C_IF_NACK_SHIFT                      7                                       /**< Shift value for I2C_NACK                    */
#define _I2C_IF_NACK_MASK                       0x80UL                                  /**< Bit mask for I2C_NACK                       */
#define _I2C_IF_NACK_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_NACK_DEFAULT                     (_I2C_IF_NACK_DEFAULT << 7)             /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_MSTOP                            (0x1UL << 8)                            /**< Leader STOP Condition Interrupt Flag        */
#define _I2C_IF_MSTOP_SHIFT                     8                                       /**< Shift value for I2C_MSTOP                   */
#define _I2C_IF_MSTOP_MASK                      0x100UL                                 /**< Bit mask for I2C_MSTOP                      */
#define _I2C_IF_MSTOP_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_MSTOP_DEFAULT                    (_I2C_IF_MSTOP_DEFAULT << 8)            /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_ARBLOST                          (0x1UL << 9)                            /**< Arbitration Lost Interrupt Flag             */
#define _I2C_IF_ARBLOST_SHIFT                   9                                       /**< Shift value for I2C_ARBLOST                 */
#define _I2C_IF_ARBLOST_MASK                    0x200UL                                 /**< Bit mask for I2C_ARBLOST                    */
#define _I2C_IF_ARBLOST_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_ARBLOST_DEFAULT                  (_I2C_IF_ARBLOST_DEFAULT << 9)          /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_BUSERR                           (0x1UL << 10)                           /**< Bus Error Interrupt Flag                    */
#define _I2C_IF_BUSERR_SHIFT                    10                                      /**< Shift value for I2C_BUSERR                  */
#define _I2C_IF_BUSERR_MASK                     0x400UL                                 /**< Bit mask for I2C_BUSERR                     */
#define _I2C_IF_BUSERR_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_BUSERR_DEFAULT                   (_I2C_IF_BUSERR_DEFAULT << 10)          /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_BUSHOLD                          (0x1UL << 11)                           /**< Bus Held Interrupt Flag                     */
#define _I2C_IF_BUSHOLD_SHIFT                   11                                      /**< Shift value for I2C_BUSHOLD                 */
#define _I2C_IF_BUSHOLD_MASK                    0x800UL                                 /**< Bit mask for I2C_BUSHOLD                    */
#define _I2C_IF_BUSHOLD_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_BUSHOLD_DEFAULT                  (_I2C_IF_BUSHOLD_DEFAULT << 11)         /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_TXOF                             (0x1UL << 12)                           /**< Transmit Buffer Overflow Interrupt Flag     */
#define _I2C_IF_TXOF_SHIFT                      12                                      /**< Shift value for I2C_TXOF                    */
#define _I2C_IF_TXOF_MASK                       0x1000UL                                /**< Bit mask for I2C_TXOF                       */
#define _I2C_IF_TXOF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_TXOF_DEFAULT                     (_I2C_IF_TXOF_DEFAULT << 12)            /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_RXUF                             (0x1UL << 13)                           /**< Receive Buffer Underflow Interrupt Flag     */
#define _I2C_IF_RXUF_SHIFT                      13                                      /**< Shift value for I2C_RXUF                    */
#define _I2C_IF_RXUF_MASK                       0x2000UL                                /**< Bit mask for I2C_RXUF                       */
#define _I2C_IF_RXUF_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_RXUF_DEFAULT                     (_I2C_IF_RXUF_DEFAULT << 13)            /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_BITO                             (0x1UL << 14)                           /**< Bus Idle Timeout Interrupt Flag             */
#define _I2C_IF_BITO_SHIFT                      14                                      /**< Shift value for I2C_BITO                    */
#define _I2C_IF_BITO_MASK                       0x4000UL                                /**< Bit mask for I2C_BITO                       */
#define _I2C_IF_BITO_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_BITO_DEFAULT                     (_I2C_IF_BITO_DEFAULT << 14)            /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_CLTO                             (0x1UL << 15)                           /**< Clock Low Timeout Interrupt Flag            */
#define _I2C_IF_CLTO_SHIFT                      15                                      /**< Shift value for I2C_CLTO                    */
#define _I2C_IF_CLTO_MASK                       0x8000UL                                /**< Bit mask for I2C_CLTO                       */
#define _I2C_IF_CLTO_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_CLTO_DEFAULT                     (_I2C_IF_CLTO_DEFAULT << 15)            /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_SSTOP                            (0x1UL << 16)                           /**< Follower STOP condition Interrupt Flag      */
#define _I2C_IF_SSTOP_SHIFT                     16                                      /**< Shift value for I2C_SSTOP                   */
#define _I2C_IF_SSTOP_MASK                      0x10000UL                               /**< Bit mask for I2C_SSTOP                      */
#define _I2C_IF_SSTOP_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_SSTOP_DEFAULT                    (_I2C_IF_SSTOP_DEFAULT << 16)           /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_RXFULL                           (0x1UL << 17)                           /**< Receive Buffer Full Interrupt Flag          */
#define _I2C_IF_RXFULL_SHIFT                    17                                      /**< Shift value for I2C_RXFULL                  */
#define _I2C_IF_RXFULL_MASK                     0x20000UL                               /**< Bit mask for I2C_RXFULL                     */
#define _I2C_IF_RXFULL_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_RXFULL_DEFAULT                   (_I2C_IF_RXFULL_DEFAULT << 17)          /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_CLERR                            (0x1UL << 18)                           /**< Clock Low Error Interrupt Flag              */
#define _I2C_IF_CLERR_SHIFT                     18                                      /**< Shift value for I2C_CLERR                   */
#define _I2C_IF_CLERR_MASK                      0x40000UL                               /**< Bit mask for I2C_CLERR                      */
#define _I2C_IF_CLERR_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_CLERR_DEFAULT                    (_I2C_IF_CLERR_DEFAULT << 18)           /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_SCLERR                           (0x1UL << 19)                           /**< SCL Error Interrupt Flag                    */
#define _I2C_IF_SCLERR_SHIFT                    19                                      /**< Shift value for I2C_SCLERR                  */
#define _I2C_IF_SCLERR_MASK                     0x80000UL                               /**< Bit mask for I2C_SCLERR                     */
#define _I2C_IF_SCLERR_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_SCLERR_DEFAULT                   (_I2C_IF_SCLERR_DEFAULT << 19)          /**< Shifted mode DEFAULT for I2C_IF             */
#define I2C_IF_SDAERR                           (0x1UL << 20)                           /**< SDA Error Interrupt Flag                    */
#define _I2C_IF_SDAERR_SHIFT                    20                                      /**< Shift value for I2C_SDAERR                  */
#define _I2C_IF_SDAERR_MASK                     0x100000UL                              /**< Bit mask for I2C_SDAERR                     */
#define _I2C_IF_SDAERR_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_IF                     */
#define I2C_IF_SDAERR_DEFAULT                   (_I2C_IF_SDAERR_DEFAULT << 20)          /**< Shifted mode DEFAULT for I2C_IF             */

